system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
    "libkEpsilonCC.so"
);

interval        100;

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6000;

deltaT          1;

writeControl    timeStep;

writeInterval   $interval;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;


// functions
// {
// //    #includeFunc  residuals
// //    
// //     turbulenceFields1
// //     {
// //         type            turbulenceFields;
// //         libs ("libfieldFunctionObjects.so");
// //         enabled         true;
// //         writeControl   timeStep;
// //         writeInterval  $interval;
// // 
// //         fields
// //         (
// //             omega
// //             R
// //         );
//     }
// }
// ************************************************************************* //
