0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    ENTRADA
    {
        type         surfaceNormalFixedValue;
        refValue     uniform -10;
        value        $internalField;
    }
    PAREDE
    {
        type            noSlip;
    }

    OVERFLOW
    {
        type            zeroGradient;
    }

    UNDERFLOW
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
