0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ENTRADA
    {
        type            zeroGradient;
    }

    PAREDE
    {
        type            fixedFluxPressure;
    }

    OVERFLOW
    {
        type            fixedMean;
        meanValue       constant 0;
        value           $internalField;
    }

    UNDERFLOW
    {
        type            fixedMean;
        meanValue       constant 0;
        value           $internalField;
    }
}

// ************************************************************************* //
