0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0027;

boundaryField
{
    ENTRADA
    {
        type            calculated;
        value           $internalField;
    }

    PAREDE
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    OVERFLOW
    {
        type            calculated;
        value           $internalField;
    }

    UNDERFLOW
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
