system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         pointCellsLeastSquares;
    grad(U)         pointCellsLeastSquares;
    grad(p)         pointCellsLeastSquares;
    grad(x)         cellLimited pointCellsLeastSquares 1;
}

divSchemes
{
    default          none;
    
    div(phi,U)       bounded Gauss vanLeerV grad(x);
    div(phi,k)       bounded Gauss upwind grad(k); //linearUpwind grad(k);
    div(phi,epsilon) bounded Gauss upwind grad(epsilon);  //linearUpwind grad(epsilon); 
    div(phi,omega)   bounded Gauss upwind;// grad(epsilon); //linearUpwind grad(epsilon);
    
    div((nuEff*dev2(T(grad(U))))) Gauss SFCD phi;
    
    //For SSTCC
    div(phi,symm(grad(U)))        bounded Gauss MUSCL; 
    
    //For LLR
    div((nu*dev2(T(grad(U)))))    Gauss linear;
    div(R)                        Gauss linear;
    div(phi,R)                    bounded Gauss linearUpwind;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

wallDist
{
    method          meshWave;
    nRequired       1;
}

// ************************************************************************* //
