system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
     {
        solver           PCG;
        preconditioner
        {
             preconditioner          GAMG;
             smoother                DIC;//ILU;
             cacheAgglomeration      true;
             nCellsInCoarsestLevel   40;//40;
             agglomerator            faceAreaPair;
             mergeLevels             1;    
        }
        tolerance        1e-12;
        relTol           1.0e-4;
        minIter          0;
        maxIter          1000;
    }

    "(U|k|epsilon|omega|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1.0e-6;
    }
    Phi
    {
        $p;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 4;
    /*consistent      yes;*/
    pRefCell        0;
    pRefValue       0;
    
    residualControl
    {
        p                       1e-5;
        "(U|k|epsilon|omega)"   1e-4;
        R                       1e-3;
    }
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               0.9;
    }
    equations
    {
        U               0.9;
        
        k               0.55;       
        omega           0.55;
        epsilon         0.55;
        
        R               0.35;
    }
}

/*potentialFlow*/
/*{*/
    /*nNonOrthogonalCorrectors 20;*/
/*}*/

// ************************************************************************* //
