system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method scotch;
numberOfSubdomains 4;
scotchCoeffs
{
}
